coq/aula1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-04-27 Fri 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 1 de Coq</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 1 de Coq</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd6f9655">1. P.A. vs A.P.</a>
<ul>
<li><a href="#org42b1004">1.1. Provadores Automáticos</a></li>
<li><a href="#org69872b8">1.2. Assistentes de Provas</a></li>
<li><a href="#org7309a95">1.3. O que Assistente de provas fazem?</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd6f9655" class="outline-2">
<h2 id="orgd6f9655"><span class="section-number-2">1</span> P.A. vs A.P.</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org42b1004" class="outline-3">
<h3 id="org42b1004"><span class="section-number-3">1.1</span> Provadores Automáticos</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Entre com uma proposição, aperte um botão e veja a resposta.</li>
<li>Fazem todo o trabalho da prova. Humanos não são necessários.</li>
<li>Limitados a domínios específicos.</li>
<li>São procedimentos de decisão.</li>
<li>Fornecem um formalismo para especificar a proposição, mas não para a sua prova. Fornecem uma valoração caso falso.</li>
</ul>
</div>
</div>
<div id="outline-container-org69872b8" class="outline-3">
<h3 id="org69872b8"><span class="section-number-3">1.2</span> Assistentes de Provas</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>São provadores semi-automáticos; Entre com uma proposição, aperte um botão e veja a resposta.</li>
<li>Uso com domínio menos restrito.</li>
<li>Podem utilizar provadores automáticos, mas ainda necessitam do humano.</li>
<li>Fornecem um formalismo para representar a prova. <i>Lembra</i> as regras da Dedução.</li>
</ul>
</div>
</div>

<div id="outline-container-org7309a95" class="outline-3">
<h3 id="org7309a95"><span class="section-number-3">1.3</span> O que Assistente de provas fazem?</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>O núcleo de um assistente de provas é um verificador, que verifica a consistência lógica da prova.</li>
<li>Fornecem de maneira interativa informações sobre o estado atual da prova.</li>
<li>Ajudam a encontrar teoremas e lemas para o progresso da prova.</li>
<li>Permitem implementar métodos não-deterministas para auxiliar a prova.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 03/05/2018</p>
<p class="author">Author: Rafael Castro</p>
<p class="date">Created: 2018-04-27 Fri 14:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
